Repository: hasansa007/SonicPlayer
Catalog: SonicPlayer/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bn, es, fr, hi, pt, ru, zh_hans

source: Trim region
ar: نطاق القص
bn: ছাঁটাইয়ের অংশ
es: Región de recorte
fr: Zone de rognage
hi: ट्रिम क्षेत्र
pt: Região de corte
ru: Область обрезки
zh_hans: 裁剪区间

source: Trim takes
ar: قص المقاطع
bn: রেকর্ডিং ট্রিম করুন
es: Recortar tomas
fr: Rogner les prises
hi: रिकॉर्डिंग ट्रिम करें
pt: Cortar tomadas
ru: Обрезать записи
zh_hans: 修剪片段

source: Trimming audio...
ar: جارٍ قص الصوت…
bn: অডিও ট্রিম করা হচ্ছে…
es: Recortando audio…
fr: Découpage de l’audio…
hi: ऑडियो ट्रिम किया जा रहा है…
pt: Cortando áudio…
ru: Обрезка аудио…
zh_hans: 正在剪辑音频…

source: Try Again
ar: إعادة المحاولة
bn: আবার চেষ্টা করুন
es: Reintentar
fr: Réessayer
hi: फिर से कोशिश करें
pt: Tentar novamente
ru: Повторить
zh_hans: 重试

source: Tune playback speed, skip duration, and appearance. Replay this quickstart any time.
ar: اضبط سرعة التشغيل ومدة التخطي والمظهر. أعد هذا الدليل السريع في أي وقت.
bn: প্লেব্যাক গতি, স্কিপ সময় এবং থিম ঠিক করুন। এই কুইকস্টার্ট যেকোনো সময় আবার চালান।
es: Ajusta la velocidad de reproducción, la duración del salto y la apariencia. Repite este inicio rápido en cualquier momento.
fr: Réglez la vitesse de lecture, la durée de saut et l’apparence. Relancez ce guide à tout moment.
hi: प्लेबैक गति, स्किप अवधि और रूप-रंग को समायोजित करें। इस क्विकस्टार्ट को कभी भी दोबारा चलाएँ।
pt: Ajuste a velocidade de reprodução, a duração do salto e a aparência. Refaça este guia rápido a qualquer momento.
ru: Настройте скорость воспроизведения, длительность перемотки и оформление. Повторяйте этот быстрый старт в любое время.
zh_hans: 调整播放速度、跳过时长和外观。随时重播此快速入门。

source: Tune playback speed, skip duration, theme, and language. Replay this quickstart any time.
ar: اضبط سرعة التشغيل ومدة التخطي والسمة واللغة. أعد هذا الدليل السريع في أي وقت.
bn: প্লেব্যাক গতি, স্কিপ সময়, থিম এবং ভাষা ঠিক করুন। এই কুইকস্টার্ট যেকোনো সময় আবার চালান।
es: Ajusta la velocidad de reproducción, la duración del salto, el tema y el idioma. Repite este inicio rápido en cualquier momento.
fr: Réglez la vitesse de lecture, la durée de saut, le thème et la langue. Relancez ce guide à tout moment.
hi: प्लेबैक गति, स्किप अवधि, थीम और भाषा समायोजित करें। इस क्विकस्टार्ट को कभी भी दोबारा चलाएँ।
pt: Ajuste a velocidade de reprodução, a duração do salto, o tema e o idioma. Refaça este guia rápido a qualquer momento.
ru: Настройте скорость воспроизведения, длительность перемотки, тему и язык. Повторяйте этот быстрый старт в любое время.
zh_hans: 调整播放速度、跳过时长、主题和语言。随时重播此快速入门。

source: Turn past the last row.
ar: أدر إلى ما بعد آخر صف.
bn: শেষ সারির ওপারে ঘোরান।
es: Gira más allá de la última fila.
fr: Tournez au-delà de la dernière ligne.
hi: अंतिम पंक्ति के आगे घुमाएँ।
pt: Rode para lá da última linha.
ru: Прокрутите за последнюю строку.
zh_hans: 转过最后一行。

source: Turn the wheel below. It is the whole app.
ar: أدر القرص بالأسفل. هو التطبيق كلّه.
bn: নিচের চাকাটি ঘোরান। এটাই পুরো অ্যাপ।
es: Gira el dial de abajo. Es toda la app.
fr: Tournez la molette ci-dessous. C'est toute l'app.
hi: नीचे का डायल घुमाएँ। यही पूरा ऐप है।
pt: Rode o disco abaixo. É toda a app.
ru: Покрутите колесо внизу. Это и есть всё приложение.
zh_hans: 转动下方的转盘，它就是整个应用。

source: Turn the wheel past the last row to reach the buttons under the card, rest on Import and press. Pick files or a whole folder. You can also open an audio file from the Files app and it will be imported and played.
ar: أدر القرص بعد آخر صف لتصل إلى الأزرار أسفل البطاقة، قف على «استيراد» واضغط. اختر ملفات أو مجلداً كاملاً. ويمكنك أيضاً فتح ملف صوتي من تطبيق «الملفات» فيُستورد ويُشغَّل.
bn: শেষ সারির পরেও চাকা ঘুরিয়ে কার্ডের নিচের বোতামগুলোয় যান, ইমপোর্টে থামুন এবং চাপ দিন। ফাইল বা পুরো ফোল্ডার বাছুন। Files অ্যাপ থেকেও অডিও ফাইল খুলতে পারেন — সেটি ইমপোর্ট হয়ে বেজে উঠবে।
es: Gira el dial más allá de la última fila para llegar a los botones bajo la tarjeta, detente en Importar y pulsa. Elige archivos o una carpeta entera. También puedes abrir un archivo de audio desde la app Archivos y se importará y se reproducirá.
fr: Tournez la molette au-delà de la dernière ligne pour atteindre les boutons sous la carte, arrêtez-vous sur Importer et appuyez. Choisissez des fichiers ou un dossier entier. Vous pouvez aussi ouvrir un fichier audio depuis l'app Fichiers : il sera importé et lu.
hi: अंतिम पंक्ति के आगे डायल घुमाकर कार्ड के नीचे के बटनों तक जाएँ, आयात पर रुकें और दबाएँ। फ़ाइलें या पूरा फ़ोल्डर चुनें। आप Files ऐप से भी ऑडियो फ़ाइल खोल सकते हैं, वह आयात होकर बज जाएगी।
pt: Rode o disco para lá da última linha para chegar aos botões por baixo do cartão, pare em Importar e prima. Escolha ficheiros ou uma pasta inteira. Também pode abrir um ficheiro de áudio a partir da app Ficheiros e ele será importado e reproduzido.
ru: Прокрутите колесо за последнюю строку к кнопкам под карточкой, остановитесь на «Импорт» и нажмите. Выберите файлы или целую папку. Можно также открыть аудиофайл из приложения «Файлы» — он будет импортирован и воспроизведён.
zh_hans: 把转盘转过最后一行，到达卡片下方的按钮，停在「导入」并按下。可以选择文件，也可以选择整个文件夹。你也可以从「文件」应用打开音频文件，它会被导入并播放。

source: Turn the wheel until the recording you want is highlighted, then press the centre. To see what is playing, press the centre and hold for a moment, or press the status line at the top of the card.
ar: أدر القرص حتى يُبرَز التسجيل الذي تريده، ثم اضغط المركز. ولمعرفة ما يُشغَّل الآن، اضغط المركز مع الاستمرار لحظة، أو اضغط سطر الحالة أعلى البطاقة.
bn: যে রেকর্ডিংটি চান সেটি হাইলাইট না হওয়া পর্যন্ত চাকা ঘোরান, তারপর কেন্দ্রে চাপ দিন। কী বাজছে দেখতে কেন্দ্রে চেপে একটু ধরে রাখুন, বা কার্ডের উপরের স্ট্যাটাস লাইনে চাপ দিন।
es: Gira el dial hasta resaltar la grabación que quieras y pulsa el centro. Para ver qué está sonando, mantén pulsado el centro un momento o pulsa la línea de estado en la parte superior de la tarjeta.
fr: Tournez la molette jusqu'à mettre en surbrillance l'enregistrement voulu, puis appuyez au centre. Pour voir ce qui est en cours de lecture, maintenez le centre un instant ou appuyez sur la ligne d'état en haut de la carte.
hi: जब तक वांछित रिकॉर्डिंग हाइलाइट न हो जाए तब तक डायल घुमाएँ, फिर केंद्र दबाएँ। क्या चल रहा है यह देखने के लिए केंद्र को एक पल दबाए रखें, या कार्ड के ऊपर की स्थिति पंक्ति दबाएँ।
pt: Rode o disco até realçar a gravação que quer e prima o centro. Para ver o que está a tocar, mantenha o centro premido por um instante ou prima a linha de estado no topo do cartão.
ru: Крутите колесо, пока нужная запись не будет выделена, затем нажмите центр. Чтобы увидеть, что играет, задержите центр на мгновение или нажмите строку состояния вверху карточки.
zh_hans: 转动转盘直到选中想要的录音，然后按下中心键。想查看正在播放的内容，按住中心键片刻，或点按卡片顶部的状态行。

source: Turn to move through your library, press the centre to play what you land on.
ar: أدر للتنقّل في مكتبتك، واضغط المركز لتشغيل ما تقف عليه.
bn: লাইব্রেরিতে চলতে ঘোরান, যেখানে থামবেন তা চালাতে কেন্দ্রে চাপ দিন।
es: Gira para recorrer tu biblioteca y pulsa el centro para reproducir donde te detengas.
fr: Tournez pour parcourir votre bibliothèque, appuyez au centre pour lire ce sur quoi vous vous arrêtez.
hi: अपनी लाइब्रेरी में चलने के लिए घुमाएँ, जहाँ रुकें उसे बजाने के लिए केंद्र दबाएँ।
pt: Rode para percorrer a sua biblioteca e prima o centro para reproduzir onde parar.
ru: Крутите, чтобы двигаться по фонотеке, и нажмите центр, чтобы включить выбранное.
zh_hans: 转动浏览曲库，按下中心键播放停留处的内容。

source: Turn to move, press to play, nudge to act
ar: أدر للتنقّل، اضغط للتشغيل، وادفع للتنفيذ
bn: ঘোরান সরাতে, চাপুন চালাতে, ঠেলুন কাজ করতে
es: Gira para moverte, pulsa para reproducir, empuja para actuar
fr: Tournez pour naviguer, appuyez pour lire, poussez pour agir
hi: चलने के लिए घुमाएँ, बजाने के लिए दबाएँ, क्रिया के लिए धकेलें
pt: Rode para navegar, prima para reproduzir, empurre para agir
ru: Крутите, чтобы перемещаться, нажимайте, чтобы играть, толкайте, чтобы действовать
zh_hans: 转动移动，按下播放，轻推执行

source: Unknown Track
ar: مسار غير معروف
bn: অজানা ট্র্যাক
es: Pista desconocida
fr: Piste inconnue
hi: अज्ञात ट्रैक
pt: Faixa desconhecida
ru: Неизвестный трек
zh_hans: 未知曲目

source: Up Next
ar: التالي
bn: পরবর্তী
es: A continuación
fr: À suivre
hi: अगला
pt: Próxima
ru: Далее
zh_hans: 接下来

source: Up to edit, down to delete, left to file, right to share. Rest your thumb and each one says its name.
ar: لأعلى للتحرير، لأسفل للحذف، لليسار للترتيب، ولليمين للمشاركة. أرِح إبهامك وسيذكر كلٌّ منها اسمه.
bn: উপরে সম্পাদনা, নিচে মুছে ফেলা, বামে ফাইল করা, ডানে শেয়ার। বুড়ো আঙুল রাখলেই প্রত্যেকটি নিজের নাম বলে।
es: Arriba para editar, abajo para eliminar, izquierda para archivar, derecha para compartir. Apoya el pulgar y cada una dice su nombre.
fr: Vers le haut pour modifier, le bas pour supprimer, la gauche pour classer, la droite pour partager. Posez le pouce et chacune annonce son nom.
hi: ऊपर संपादन, नीचे हटाना, बाएँ फ़ाइल करना, दाएँ साझा करना। अंगूठा टिकाएँ और हर एक अपना नाम बताएगा।
pt: Para cima editar, para baixo eliminar, para a esquerda arquivar, para a direita partilhar. Pouse o polegar e cada uma diz o seu nome.
ru: Вверх — правка, вниз — удаление, влево — в папку, вправо — поделиться. Задержите палец, и каждое действие себя назовёт.
zh_hans: 上推编辑，下推删除，左推归档，右推分享。手指停住，每个动作都会报出名字。

source: Use the Recordings tab to capture audio. Start, pause, and stop, then trim takes.
ar: استخدم تبويب التسجيلات لالتقاط الصوت. ابدأ وأوقف مؤقتًا وأوقف، ثم قص المقاطع.
bn: অডিও ধারণের জন্য রেকর্ডিংস ট্যাব ব্যবহার করুন। শুরু করুন, বিরতি দিন, থামান, তারপর ট্রিম করুন।
es: Usa la pestaña Grabaciones para capturar audio. Inicia, pausa y detén, luego recorta las tomas.
fr: Utilisez l’onglet Enregistrements pour capturer l’audio. Démarrez, mettez en pause et arrêtez, puis rognez les prises.
hi: ऑडियो कैप्चर करने के लिए रिकॉर्डिंग्स टैब का उपयोग करें। शुरू करें, पॉज़ करें और रोकें, फिर ट्रिम करें।
pt: Use a aba Gravações para capturar áudio. Inicie, pause e pare, depois corte as tomadas.
ru: Используйте вкладку «Записи» для записи аудио. Запускайте, ставьте на паузу и останавливайте, затем обрезайте записи.
zh_hans: 使用“录音”标签来录制音频。开始、暂停、停止，然后修剪片段。

source: Version %@
ar: الإصدار %@
bn: সংস্করণ %@
es: Versión %@
hi: संस्करण %@
pt: Versão %@
ru: Версия %@
zh_hans: 版本 %@

source: Waveform + trim tools
ar: شكل الموجة + أدوات القص
bn: ওয়েভফর্ম + ট্রিম টুলস
es: Forma de onda + herramientas de recorte
fr: Forme d’onde + outils de coupe
hi: वेवफ़ॉर्म + ट्रिम टूल्स
pt: Forma de onda + ferramentas de corte
ru: Волновая форма + инструменты обрезки
zh_hans: 波形 + 修剪工具

source: We're here to help! Reach out through any of these channels:
ar: نحن هنا للمساعدة! تواصل معنا عبر أي من هذه القنوات:
bn: আমরা সাহায্য করতে এখানে আছি! নিচের যেকোনো মাধ্যমে যোগাযোগ করুন:
es: Estamos aquí para ayudar. Contáctanos por cualquiera de estos canales:
fr: Nous sommes là pour vous aider ! Contactez-nous via l’un de ces canaux :
hi: हम मदद के लिए यहाँ हैं! इन माध्यमों से संपर्क करें:
pt: Estamos aqui para ajudar! Fale conosco por qualquer um destes canais:
ru: Мы всегда готовы помочь! Свяжитесь с нами любым из этих способов:
zh_hans: 我们随时为您提供帮助！可通过以下方式联系我们：

source: What it is for
ar: لماذا هذا التطبيق
bn: এটি কীসের জন্য
es: Para qué sirve
fr: À quoi ça sert
hi: यह किसलिए है
pt: Para que serve
ru: Для чего это
zh_hans: 用途

source: Yes, always. Your files are on the device and there is no account and no network request, so nothing about the app depends on a connection.
ar: نعم، دائماً. ملفاتك على الجهاز، ولا حساب ولا أي طلب شبكة، فلا شيء في التطبيق يعتمد على الاتصال.
bn: হ্যাঁ, সবসময়। আপনার ফাইল ডিভাইসেই থাকে, কোনো অ্যাকাউন্ট বা নেটওয়ার্ক অনুরোধ নেই, তাই অ্যাপের কিছুই সংযোগের উপর নির্ভর করে না।
es: Sí, siempre. Tus archivos están en el dispositivo y no hay cuenta ni peticiones de red, así que nada de la app depende de una conexión.
fr: Oui, toujours. Vos fichiers sont sur l'appareil, sans compte ni requête réseau : rien dans l'app ne dépend d'une connexion.
hi: हाँ, हमेशा। आपकी फ़ाइलें डिवाइस पर हैं और न कोई खाता है न नेटवर्क अनुरोध, इसलिए ऐप का कुछ भी कनेक्शन पर निर्भर नहीं करता।
pt: Sim, sempre. Os seus ficheiros estão no dispositivo e não há conta nem pedidos de rede, por isso nada na app depende de uma ligação.
ru: Да, всегда. Ваши файлы на устройстве, аккаунта и сетевых запросов нет, поэтому ничто в приложении не зависит от соединения.
zh_hans: 是的，始终可以。你的文件都在设备上，没有账号也没有网络请求，因此应用的任何功能都不依赖网络连接。

source: You Might Like
ar: قد يعجبك
bn: আপনার পছন্দ হতে পারে
es: Te puede gustar
fr: Vous pourriez aimer
hi: आपको यह पसंद आ सकता है
pt: Você pode gostar
ru: Вам может понравиться
zh_hans: 你可能喜欢

source: Your audio. Your space.
ar: صوتك. مساحتك.
bn: আপনার অডিও। আপনার জায়গা।
es: Tu audio. Tu espacio.
fr: Votre audio. Votre espace.
hi: आपका ऑडियो। आपकी जगह।
pt: O seu áudio. O seu espaço.
ru: Ваше аудио. Ваше пространство.
zh_hans: 你的音频，你的空间。

source: Your files stay on the phone
ar: ملفاتك تبقى على الهاتف
bn: আপনার ফাইল ফোনেই থাকে
es: Tus archivos se quedan en el teléfono
fr: Vos fichiers restent sur le téléphone
hi: आपकी फ़ाइलें फ़ोन पर ही रहती हैं
pt: Os seus ficheiros ficam no telemóvel
ru: Ваши файлы остаются на телефоне
zh_hans: 文件始终留在手机上

source: Your own audio, no ads and no algorithms
ar: صوتك أنت، بلا إعلانات ولا خوارزميات
bn: আপনার নিজের অডিও, বিজ্ঞাপন ও অ্যালগরিদম ছাড়া
es: Tu propio audio, sin anuncios ni algoritmos
fr: Votre propre audio, sans publicité ni algorithme
hi: आपका अपना ऑडियो, न विज्ञापन न एल्गोरिद्म
pt: O seu próprio áudio, sem anúncios nem algoritmos
ru: Только ваше аудио — без рекламы и алгоритмов
zh_hans: 你自己的音频，没有广告和算法

source: Your recordings are stored on the device and never uploaded. The app needs no account and no connection, so it works the same on a plane as at home.
ar: تُحفظ تسجيلاتك على الجهاز ولا تُرفع أبداً. لا يحتاج التطبيق إلى حساب ولا اتصال، فيعمل في الطائرة كما يعمل في البيت.
bn: আপনার রেকর্ডিং ডিভাইসেই থাকে, কখনও আপলোড হয় না। অ্যাপটির কোনো অ্যাকাউন্ট বা সংযোগ লাগে না, তাই উড়োজাহাজে আর বাড়িতে একইভাবে চলে।
es: Tus grabaciones se guardan en el dispositivo y nunca se suben. La app no necesita cuenta ni conexión, así que funciona igual en un avión que en casa.
fr: Vos enregistrements sont stockés sur l'appareil et ne sont jamais envoyés. L'app ne demande ni compte ni connexion : elle fonctionne pareil en avion et chez vous.
hi: आपकी रिकॉर्डिंग डिवाइस पर ही रहती हैं और कभी अपलोड नहीं होतीं। ऐप को न खाता चाहिए न कनेक्शन, इसलिए यह हवाई जहाज़ में भी वैसे ही चलता है जैसे घर पर।
pt: As suas gravações ficam guardadas no dispositivo e nunca são carregadas. A app não precisa de conta nem de ligação, por isso funciona da mesma forma num avião e em casa.
ru: Ваши записи хранятся на устройстве и никогда не выгружаются. Приложению не нужны ни аккаунт, ни соединение, поэтому в самолёте оно работает так же, как дома.
zh_hans: 你的录音保存在设备上，绝不会上传。应用不需要账号也不需要联网，在飞机上和在家里表现完全一样。

source: keep turning for the buttons
ar: تابع اللف للوصول إلى الأزرار
bn: বোতামের জন্য ঘোরাতে থাকুন
es: sigue girando para los botones
fr: continuez à tourner pour les boutons
hi: बटनों के लिए घुमाते रहें
pt: continue girando para os botões
ru: крутите дальше — там кнопки
zh_hans: 继续转动即可到达按钮

source: v%@
ar: الإصدار %@
